{
  "format": "layers-model",
  "generatedBy": null,
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "modelTopology": null,
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of25.bin",
        "group1-shard2of25.bin",
        "group1-shard3of25.bin",
        "group1-shard4of25.bin",
        "group1-shard5of25.bin",
        "group1-shard6of25.bin",
        "group1-shard7of25.bin",
        "group1-shard8of25.bin",
        "group1-shard9of25.bin",
        "group1-shard10of25.bin",
        "group1-shard11of25.bin",
        "group1-shard12of25.bin",
        "group1-shard13of25.bin",
        "group1-shard14of25.bin",
        "group1-shard15of25.bin",
        "group1-shard16of25.bin",
        "group1-shard17of25.bin",
        "group1-shard18of25.bin",
        "group1-shard19of25.bin",
        "group1-shard20of25.bin",
        "group1-shard21of25.bin",
        "group1-shard22of25.bin",
        "group1-shard23of25.bin",
        "group1-shard24of25.bin",
        "group1-shard25of25.bin"
      ],
      "weights": [
        { "name": "conv1/kernel", "shape": [7, 7, 3, 64], "dtype": "float32" },
        { "name": "bn_conv1/gamma", "shape": [64], "dtype": "float32" },
        { "name": "bn_conv1/beta", "shape": [64], "dtype": "float32" },
        { "name": "bn_conv1/moving_mean", "shape": [64], "dtype": "float32" },
        {
          "name": "bn_conv1/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "res2a_branch2a/kernel",
          "shape": [1, 1, 64, 64],
          "dtype": "float32"
        },
        { "name": "bn2a_branch2a/gamma", "shape": [64], "dtype": "float32" },
        { "name": "bn2a_branch2a/beta", "shape": [64], "dtype": "float32" },
        {
          "name": "bn2a_branch2a/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "bn2a_branch2a/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "res2a_branch2b/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        { "name": "bn2a_branch2b/gamma", "shape": [64], "dtype": "float32" },
        { "name": "bn2a_branch2b/beta", "shape": [64], "dtype": "float32" },
        {
          "name": "bn2a_branch2b/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "bn2a_branch2b/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "res2a_branch2c/kernel",
          "shape": [1, 1, 64, 256],
          "dtype": "float32"
        },
        {
          "name": "res2a_branch1/kernel",
          "shape": [1, 1, 64, 256],
          "dtype": "float32"
        },
        { "name": "bn2a_branch2c/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn2a_branch2c/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn2a_branch2c/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn2a_branch2c/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        { "name": "bn2a_branch1/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn2a_branch1/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn2a_branch1/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn2a_branch1/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res2b_branch2a/kernel",
          "shape": [1, 1, 256, 64],
          "dtype": "float32"
        },
        { "name": "bn2b_branch2a/gamma", "shape": [64], "dtype": "float32" },
        { "name": "bn2b_branch2a/beta", "shape": [64], "dtype": "float32" },
        {
          "name": "bn2b_branch2a/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "bn2b_branch2a/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "res2b_branch2b/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        { "name": "bn2b_branch2b/gamma", "shape": [64], "dtype": "float32" },
        { "name": "bn2b_branch2b/beta", "shape": [64], "dtype": "float32" },
        {
          "name": "bn2b_branch2b/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "bn2b_branch2b/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "res2b_branch2c/kernel",
          "shape": [1, 1, 64, 256],
          "dtype": "float32"
        },
        { "name": "bn2b_branch2c/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn2b_branch2c/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn2b_branch2c/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn2b_branch2c/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res2c_branch2a/kernel",
          "shape": [1, 1, 256, 64],
          "dtype": "float32"
        },
        { "name": "bn2c_branch2a/gamma", "shape": [64], "dtype": "float32" },
        { "name": "bn2c_branch2a/beta", "shape": [64], "dtype": "float32" },
        {
          "name": "bn2c_branch2a/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "bn2c_branch2a/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "res2c_branch2b/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        { "name": "bn2c_branch2b/gamma", "shape": [64], "dtype": "float32" },
        { "name": "bn2c_branch2b/beta", "shape": [64], "dtype": "float32" },
        {
          "name": "bn2c_branch2b/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "bn2c_branch2b/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "res2c_branch2c/kernel",
          "shape": [1, 1, 64, 256],
          "dtype": "float32"
        },
        { "name": "bn2c_branch2c/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn2c_branch2c/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn2c_branch2c/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn2c_branch2c/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res3a_branch2a/kernel",
          "shape": [1, 1, 256, 128],
          "dtype": "float32"
        },
        { "name": "bn3a_branch2a/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3a_branch2a/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3a_branch2a/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3a_branch2a/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3a_branch2b/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "bn3a_branch2b/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3a_branch2b/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3a_branch2b/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3a_branch2b/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3a_branch2c/kernel",
          "shape": [1, 1, 128, 512],
          "dtype": "float32"
        },
        {
          "name": "res3a_branch1/kernel",
          "shape": [1, 1, 256, 512],
          "dtype": "float32"
        },
        { "name": "bn3a_branch2c/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn3a_branch2c/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn3a_branch2c/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn3a_branch2c/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        { "name": "bn3a_branch1/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn3a_branch1/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn3a_branch1/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn3a_branch1/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res3b_branch2a/kernel",
          "shape": [1, 1, 512, 128],
          "dtype": "float32"
        },
        { "name": "bn3b_branch2a/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3b_branch2a/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3b_branch2a/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3b_branch2a/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3b_branch2b/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "bn3b_branch2b/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3b_branch2b/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3b_branch2b/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3b_branch2b/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3b_branch2c/kernel",
          "shape": [1, 1, 128, 512],
          "dtype": "float32"
        },
        { "name": "bn3b_branch2c/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn3b_branch2c/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn3b_branch2c/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn3b_branch2c/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res3c_branch2a/kernel",
          "shape": [1, 1, 512, 128],
          "dtype": "float32"
        },
        { "name": "bn3c_branch2a/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3c_branch2a/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3c_branch2a/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3c_branch2a/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3c_branch2b/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "bn3c_branch2b/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3c_branch2b/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3c_branch2b/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3c_branch2b/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3c_branch2c/kernel",
          "shape": [1, 1, 128, 512],
          "dtype": "float32"
        },
        { "name": "bn3c_branch2c/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn3c_branch2c/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn3c_branch2c/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn3c_branch2c/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res3d_branch2a/kernel",
          "shape": [1, 1, 512, 128],
          "dtype": "float32"
        },
        { "name": "bn3d_branch2a/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3d_branch2a/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3d_branch2a/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3d_branch2a/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3d_branch2b/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "bn3d_branch2b/gamma", "shape": [128], "dtype": "float32" },
        { "name": "bn3d_branch2b/beta", "shape": [128], "dtype": "float32" },
        {
          "name": "bn3d_branch2b/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "bn3d_branch2b/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "res3d_branch2c/kernel",
          "shape": [1, 1, 128, 512],
          "dtype": "float32"
        },
        { "name": "bn3d_branch2c/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn3d_branch2c/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn3d_branch2c/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn3d_branch2c/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res4a_branch2a/kernel",
          "shape": [1, 1, 512, 256],
          "dtype": "float32"
        },
        { "name": "bn4a_branch2a/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4a_branch2a/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4a_branch2a/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4a_branch2a/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4a_branch2b/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "bn4a_branch2b/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4a_branch2b/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4a_branch2b/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4a_branch2b/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4a_branch2c/kernel",
          "shape": [1, 1, 256, 1024],
          "dtype": "float32"
        },
        {
          "name": "res4a_branch1/kernel",
          "shape": [1, 1, 512, 1024],
          "dtype": "float32"
        },
        { "name": "bn4a_branch2c/gamma", "shape": [1024], "dtype": "float32" },
        { "name": "bn4a_branch2c/beta", "shape": [1024], "dtype": "float32" },
        {
          "name": "bn4a_branch2c/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bn4a_branch2c/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        { "name": "bn4a_branch1/gamma", "shape": [1024], "dtype": "float32" },
        { "name": "bn4a_branch1/beta", "shape": [1024], "dtype": "float32" },
        {
          "name": "bn4a_branch1/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bn4a_branch1/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "res4b_branch2a/kernel",
          "shape": [1, 1, 1024, 256],
          "dtype": "float32"
        },
        { "name": "bn4b_branch2a/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4b_branch2a/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4b_branch2a/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4b_branch2a/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4b_branch2b/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "bn4b_branch2b/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4b_branch2b/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4b_branch2b/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4b_branch2b/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4b_branch2c/kernel",
          "shape": [1, 1, 256, 1024],
          "dtype": "float32"
        },
        { "name": "bn4b_branch2c/gamma", "shape": [1024], "dtype": "float32" },
        { "name": "bn4b_branch2c/beta", "shape": [1024], "dtype": "float32" },
        {
          "name": "bn4b_branch2c/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bn4b_branch2c/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "res4c_branch2a/kernel",
          "shape": [1, 1, 1024, 256],
          "dtype": "float32"
        },
        { "name": "bn4c_branch2a/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4c_branch2a/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4c_branch2a/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4c_branch2a/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4c_branch2b/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "bn4c_branch2b/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4c_branch2b/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4c_branch2b/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4c_branch2b/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4c_branch2c/kernel",
          "shape": [1, 1, 256, 1024],
          "dtype": "float32"
        },
        { "name": "bn4c_branch2c/gamma", "shape": [1024], "dtype": "float32" },
        { "name": "bn4c_branch2c/beta", "shape": [1024], "dtype": "float32" },
        {
          "name": "bn4c_branch2c/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bn4c_branch2c/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "res4d_branch2a/kernel",
          "shape": [1, 1, 1024, 256],
          "dtype": "float32"
        },
        { "name": "bn4d_branch2a/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4d_branch2a/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4d_branch2a/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4d_branch2a/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4d_branch2b/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "bn4d_branch2b/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4d_branch2b/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4d_branch2b/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4d_branch2b/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4d_branch2c/kernel",
          "shape": [1, 1, 256, 1024],
          "dtype": "float32"
        },
        { "name": "bn4d_branch2c/gamma", "shape": [1024], "dtype": "float32" },
        { "name": "bn4d_branch2c/beta", "shape": [1024], "dtype": "float32" },
        {
          "name": "bn4d_branch2c/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bn4d_branch2c/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "res4e_branch2a/kernel",
          "shape": [1, 1, 1024, 256],
          "dtype": "float32"
        },
        { "name": "bn4e_branch2a/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4e_branch2a/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4e_branch2a/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4e_branch2a/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4e_branch2b/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "bn4e_branch2b/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4e_branch2b/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4e_branch2b/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4e_branch2b/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4e_branch2c/kernel",
          "shape": [1, 1, 256, 1024],
          "dtype": "float32"
        },
        { "name": "bn4e_branch2c/gamma", "shape": [1024], "dtype": "float32" },
        { "name": "bn4e_branch2c/beta", "shape": [1024], "dtype": "float32" },
        {
          "name": "bn4e_branch2c/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bn4e_branch2c/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "res4f_branch2a/kernel",
          "shape": [1, 1, 1024, 256],
          "dtype": "float32"
        },
        { "name": "bn4f_branch2a/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4f_branch2a/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4f_branch2a/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4f_branch2a/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4f_branch2b/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "bn4f_branch2b/gamma", "shape": [256], "dtype": "float32" },
        { "name": "bn4f_branch2b/beta", "shape": [256], "dtype": "float32" },
        {
          "name": "bn4f_branch2b/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bn4f_branch2b/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "res4f_branch2c/kernel",
          "shape": [1, 1, 256, 1024],
          "dtype": "float32"
        },
        { "name": "bn4f_branch2c/gamma", "shape": [1024], "dtype": "float32" },
        { "name": "bn4f_branch2c/beta", "shape": [1024], "dtype": "float32" },
        {
          "name": "bn4f_branch2c/moving_mean",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bn4f_branch2c/moving_variance",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "res5a_branch2a/kernel",
          "shape": [1, 1, 1024, 512],
          "dtype": "float32"
        },
        { "name": "bn5a_branch2a/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn5a_branch2a/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn5a_branch2a/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn5a_branch2a/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res5a_branch2b/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "bn5a_branch2b/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn5a_branch2b/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn5a_branch2b/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn5a_branch2b/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res5a_branch2c/kernel",
          "shape": [1, 1, 512, 2048],
          "dtype": "float32"
        },
        {
          "name": "res5a_branch1/kernel",
          "shape": [1, 1, 1024, 2048],
          "dtype": "float32"
        },
        { "name": "bn5a_branch2c/gamma", "shape": [2048], "dtype": "float32" },
        { "name": "bn5a_branch2c/beta", "shape": [2048], "dtype": "float32" },
        {
          "name": "bn5a_branch2c/moving_mean",
          "shape": [2048],
          "dtype": "float32"
        },
        {
          "name": "bn5a_branch2c/moving_variance",
          "shape": [2048],
          "dtype": "float32"
        },
        { "name": "bn5a_branch1/gamma", "shape": [2048], "dtype": "float32" },
        { "name": "bn5a_branch1/beta", "shape": [2048], "dtype": "float32" },
        {
          "name": "bn5a_branch1/moving_mean",
          "shape": [2048],
          "dtype": "float32"
        },
        {
          "name": "bn5a_branch1/moving_variance",
          "shape": [2048],
          "dtype": "float32"
        },
        {
          "name": "res5b_branch2a/kernel",
          "shape": [1, 1, 2048, 512],
          "dtype": "float32"
        },
        { "name": "bn5b_branch2a/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn5b_branch2a/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn5b_branch2a/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn5b_branch2a/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res5b_branch2b/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "bn5b_branch2b/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn5b_branch2b/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn5b_branch2b/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn5b_branch2b/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res5b_branch2c/kernel",
          "shape": [1, 1, 512, 2048],
          "dtype": "float32"
        },
        { "name": "bn5b_branch2c/gamma", "shape": [2048], "dtype": "float32" },
        { "name": "bn5b_branch2c/beta", "shape": [2048], "dtype": "float32" },
        {
          "name": "bn5b_branch2c/moving_mean",
          "shape": [2048],
          "dtype": "float32"
        },
        {
          "name": "bn5b_branch2c/moving_variance",
          "shape": [2048],
          "dtype": "float32"
        },
        {
          "name": "res5c_branch2a/kernel",
          "shape": [1, 1, 2048, 512],
          "dtype": "float32"
        },
        { "name": "bn5c_branch2a/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn5c_branch2a/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn5c_branch2a/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn5c_branch2a/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res5c_branch2b/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        { "name": "bn5c_branch2b/gamma", "shape": [512], "dtype": "float32" },
        { "name": "bn5c_branch2b/beta", "shape": [512], "dtype": "float32" },
        {
          "name": "bn5c_branch2b/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bn5c_branch2b/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "res5c_branch2c/kernel",
          "shape": [1, 1, 512, 2048],
          "dtype": "float32"
        },
        { "name": "bn5c_branch2c/gamma", "shape": [2048], "dtype": "float32" },
        { "name": "bn5c_branch2c/beta", "shape": [2048], "dtype": "float32" },
        {
          "name": "bn5c_branch2c/moving_mean",
          "shape": [2048],
          "dtype": "float32"
        },
        {
          "name": "bn5c_branch2c/moving_variance",
          "shape": [2048],
          "dtype": "float32"
        },
        {
          "name": "in5/kernel",
          "shape": [1, 1, 2048, 256],
          "dtype": "float32"
        },
        { "name": "in5/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "in4/kernel",
          "shape": [1, 1, 1024, 256],
          "dtype": "float32"
        },
        { "name": "in4/bias", "shape": [256], "dtype": "float32" },
        { "name": "in3/kernel", "shape": [1, 1, 512, 256], "dtype": "float32" },
        { "name": "in3/bias", "shape": [256], "dtype": "float32" },
        { "name": "in2/kernel", "shape": [1, 1, 256, 256], "dtype": "float32" },
        { "name": "in2/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "conv2d_3/kernel",
          "shape": [3, 3, 256, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_3/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2d_2/kernel",
          "shape": [3, 3, 256, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_2/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 256, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_1/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2d_4/kernel",
          "shape": [3, 3, 256, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_4/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2d_5/kernel",
          "shape": [3, 3, 256, 64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_1/kernel",
          "shape": [2, 2, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_transpose_2/kernel",
          "shape": [2, 2, 1, 64],
          "dtype": "float32"
        },
        { "name": "conv2d_transpose_2/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
